Autodesk.Revit.DB.ViewportRotation
Rotation of the viewport
Since:
2013

Autodesk.Revit.DB.ViewportRotation.Counterclockwise
Viewport is rotated 90 degrees counterclockwise.

Autodesk.Revit.DB.ViewportRotation.Clockwise
Viewport is rotated 90 degrees clockwise.

Autodesk.Revit.DB.ViewportRotation.None
Viewport is not rotated.